


/* -------------------------------------------------------------------------------------------------------------------------- */
叉积的意义：
	(1) A x B = |A|·|B|·sinα
	    其中α表示A到B的夹角，用以判断该角度的正负
		这个结论可用于四个点中任意三个点构成的三角形，判断另外一个点是否在三角形中，那么四个点构成三个向量的叉积的结果就能判断
	(2) A x B = x1·y2 - x2·y1
		得到的结果是向量，但是取其模即A和B构成的平行四边形的面积，进而得到两个三角形的面积
	(3) A x B = x1·y2 - x2·y1
		得到的结果向量垂直与A, B





/* blog 摘录   --------------------------------------------------------------------------------------------------------------- */
向量点积(Dot Product),向量叉积(Cross Product) : http://blog.csdn.net/fox64194167/article/details/8147460
