/*
    排列题      好题

    题意：求出一个1-n的全排列，使得P(P(i)) = n+1-i.

    设P(x) = y ---> P(y) = P(P(x)) = n+1-x。连续应用此式有：
      P(x) = y
      P(y) = n+1-x
      P(n+1-x) = n+1-y
      P(n+1-y) = x

    可见用该式4次后又回来了.4个一组，每组能相互跳，特殊地中间可能单出一个来, 不难知P[mid] = mid.

    证当n % 4 == 2或3时无解：由上述可知，一组4个，假设n%4==2时有解，则该组元素应该有两个，则需y = n+1-y, x = n+1-x-->x+y = n+1, 联立这3个方程得x=y. 
    而x=y的话P(P(x)) = x，说明该组元素只有一个，假设不成立. n%4=3的证明应该时类似的。


    反思：题目已给出规则之后，可以先尝试着应用几次规则，看看会不会发现什么规律。
*/
//cf 176 C
#include <stdio.h>
int p[100005];

int main()
{
    int n;
    scanf("%d", &n);
    if(n % 4 == 2 || n % 4 == 3) {
        puts("-1");
        return 0;
    }
    for(int i = 1; i*2 <= n; i += 2) {
        int x = i, y = i+1;
        p[x] = y;
        p[y] = n+1-x;
        p[n+1-x] = n+1-y;
        p[n+1-y] = x;
    }
    if(n & 1) p[(n+1)/2] = (n+1)/2;
    for(int i = 1; i <= n; i++) printf("%d ", p[i]);
    printf("\n");
    return 0;
}
